In [4]:
import pandas as pd
import numpy as np

In [6]:
city_temps = pd.DataFrame({'Tulsa':[78.5,80.0,75.1,np.nan, np.nan],
                          'Dallas': [89.5,92.3,np.nan,np.nan,95.0]},
                         index=['Mon','Tue','Wed','Thu','Fri'])
city_temps

     Tulsa  Dallas
Mon   78.5    89.5
Tue   80.0    92.3
Wed   75.1     NaN
Thu    NaN     NaN
Fri    NaN    95.0

In [7]:
city_temps.dropna()

     Tulsa  Dallas
Mon   78.5    89.5
Tue   80.0    92.3

In [8]:
city_temps.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [Mon, Tue, Wed, Thu, Fri]

In [10]:
city_temps.dropna(how='all')

     Tulsa  Dallas
Mon   78.5    89.5
Tue   80.0    92.3
Wed   75.1     NaN
Fri    NaN    95.0

In [11]:
city_temps.dropna(thresh=1)

     Tulsa  Dallas
Mon   78.5    89.5
Tue   80.0    92.3
Wed   75.1     NaN
Fri    NaN    95.0

In [12]:
city_temps.dropna(subset=['Dallas'])

     Tulsa  Dallas
Mon   78.5    89.5
Tue   80.0    92.3
Fri    NaN    95.0